tap "azure/functions"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
# Run your GitHub Actions locally 🚀
brew "act"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Automatic configure script builder
brew "autoconf"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Tool for exploring each layer in a docker image
brew "dive"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Secure Reliable Transport
brew "srt"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Distributed revision control system
brew "git"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Network authentication protocol
brew "krb5"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# C websockets server library
brew "libwebsockets"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Message broker implementing the MQTT protocol
brew "mosquitto"
# Open source relational database management system
brew "mysql"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node@14"
# Object-relational database system
brew "postgresql"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# RC file (dotfile) management
brew "rcm"
# User interface to the TELNET protocol
brew "telnet"
# Thin wrapper for Terraform e.g. for locking state
brew "terragrunt"
# Terraform version manager inspired by rbenv
brew "tfenv", link: false
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk"
# Enable Windows-like alt-tab
cask "alt-tab"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# File system integration
cask "macfuse"
# File system integration
cask "osxfuse"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
# Multi-platform graphical interface for official Nmap Security Scanner
cask "zenmap"
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Brother iPrint&Scan", id: 1193539993
mas "Countdowns", id: 917514700
mas "GarageBand", id: 682658836
mas "GoodNotes", id: 1444383602
mas "iMovie", id: 408981434
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "Messenger", id: 1480068668
mas "Microsoft Remote Desktop", id: 1295203466
mas "RunCat", id: 1429033973
mas "Skitch", id: 425955336
mas "Slack", id: 803453959
mas "Speedtest", id: 1153157709
mas "Telegram", id: 747648890
mas "Teleprompter", id: 417605357
mas "The Unarchiver", id: 425424353
mas "Trello", id: 1278508951
mas "Xcode", id: 497799835
