tap "1password/tap"
tap "azure/functions"
tap "hashicorp/tap"
tap "helm/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "norwoodj/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "turbot/tap"
# Run your GitHub Actions locally 🚀
brew "act"
# Automate deployment, configuration, and upgrading
brew "ansible"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Automatic configure script builder
brew "autoconf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Bash Automated Testing System
brew "bats-core"
# Core application library for C
brew "glib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Tool Command Language
brew "tcl-tk"
# Object-file caching compiler wrapper
brew "ccache"
# Cross-platform make
brew "cmake"
# USB programmer
brew "dfu-util"
# Tool for exploring each layer in a docker image
brew "dive"
# Device tree compiler
brew "dtc"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# Secure Reliable Transport
brew "srt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Library for encoding and decoding .avif files
brew "libavif"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Interpreter for PostScript and PDF
brew "ghostscript", link: false
# Distributed revision control system
brew "git"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Image manipulation
brew "netpbm"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Kubernetes package manager
brew "helm"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# C websockets server library
brew "libwebsockets"
# Next-gen compiler infrastructure
brew "llvm"
# Friendly wrapper for launchctl
brew "lunchy"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Platform built on V8 to build network applications
brew "node@16"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Message broker implementing the MQTT protocol
brew "mosquitto"
# Open source relational database management system
brew "mysql"
# HTTP/2 C Library
brew "nghttp2"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Small build system for use with gyp or CMake
brew "ninja"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node@14"
# Friendly PIL fork (Python Imaging Library)
brew "pillow"
# Object-relational database system
brew "postgresql@14"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8", link: false
# RC file (dotfile) management
brew "rcm"
# User interface to the TELNET protocol
brew "telnet"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Thin wrapper for Terraform e.g. for locking state
brew "terragrunt"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Better and friendly vi(vim) mode plugin for ZSH
brew "zsh-vi-mode"
# Terraform
brew "hashicorp/tap/terraform", link: false
# Hosting Helm Charts via GitHub Pages and Releases
brew "helm/tap/chart-releaser"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Automatically generate markdown documentation for helm charts
brew "norwoodj/tap/helm-docs"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk"
# Steampipe exposes APIs and services as a high-performance relational database, giving you the ability to write SQL-based queries to explore, assess and report on dynamic data.
brew "turbot/tap/steampipe"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Enable Windows-like alt-tab
cask "alt-tab"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Pre-built GNU bare-metal toolchain for 32-bit Arm processors
cask "gcc-arm-embedded"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# File system integration
cask "macfuse"
# File system integration
cask "osxfuse"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
# Development environment
cask "vagrant"
# Multi-platform graphical interface for official Nmap Security Scanner
cask "zenmap"
mas "1Password for Safari", id: 1569813296
mas "Brother iPrint&Scan", id: 1193539993
mas "Charmstone", id: 1563735522
mas "GarageBand", id: 682658836
mas "GoodNotes", id: 1444383602
mas "iMovie", id: 408981434
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "Messenger", id: 1480068668
mas "Microsoft Remote Desktop", id: 1295203466
mas "rcmd", id: 1596283165
mas "RunCat", id: 1429033973
mas "Sequel Ace", id: 1518036000
mas "Slack", id: 803453959
mas "Tag Editor Free", id: 984278082
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
mas "Time Out", id: 402592703
mas "Trello", id: 1278508951
mas "Xcode", id: 497799835
